INSERT INTO `attendence_check`.`clerk`
(`id`,`name`,`department`,`leader`,`record`,`grade`,`attendence`,`not_pass_times`)
VALUES
('2019000000','张三','教育部门','教育部部长', 0, 5,'pass',0),
('2019000001','李四','行政部门','行政部部长', 1, 4,'pass',0),
('2019000002','王五','科研部门','科研部部长', 2, 3,'pass',0),
('2019000003','胡六','艺术部门','艺术部部长', 3, 2,'pass',0),
('2019000004','曾七','教育部门','教育部部长', 0, 10,'pass',0),
('2019000005','陈八','艺术部门','艺术部部长', 1, 9,'pass',0),
('2019000006','黄九','体育部门','体育部部长', 2, 8,'pass',0),
('2019000007','牛十','宣传部门','宣传部部长', 3, 7,'pass',0),
('2019000008','张十一','艺术部门','艺术部部长', 0, 15,'pass',0),
('2019000009','武十二','行政部门','行政部部长', 1, 14,'pass',0),
('2019000010','刘十三','科研部门','科研部部长', 2, 13,'pass',0),
('2019000011','卢十四','体育部门','体育部部长', 3, 12,'pass',0);
select * from clerk;